076923.python-image-preview
alexcvzz.vscode-sqlite
antfu.theme-vitesse
charliermarsh.ruff
christian-kohler.path-intellisense
codediagram.codediagram
continue.continue
eamodio.gitlens
emilast.logfilehighlighter
esbenp.prettier-vscode
github.copilot
github.copilot-chat
google.geminicodeassist
hediet.vscode-drawio
irongeek.vscode-env
jnoortheen.nix-ide
johnpapa.vscode-peacock
mechatroner.rainbow-csv
meezilla.json
mermaidchart.vscode-mermaid-chart
mhutchie.git-graph
monokai.theme-monokai-pro-vscode
ms-azuretools.vscode-containers
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.tensorboard
ms-toolsai.vscode-jupyter-cell-tags
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.azure-repos
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vscode.remote-server
njpwerner.autodocstring
njqdev.vscode-python-typehint
pkief.material-icon-theme
qwtel.sqlite-viewer
redhat.vscode-yaml
rioj7.command-variable
ritwickdey.liveserver
stackbreak.comment-divider
tomoki1207.pdf
torreysmith.copyfilepathandcontent
